src/Catalogs/ОбъектыМетаданныхПО/ОбъектыМетаданныхПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданныхПО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МожетИметьПоказатели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяТриггером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ПоказателиОбъектовПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСсылкуОбъектаМетаданных(ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмяМетаданных);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбъектыМетаданныхПО.Ссылка
		|ИЗ
		|	Справочник.ОбъектыМетаданныхПО КАК ОбъектыМетаданныхПО
		|ГДЕ
		|	ОбъектыМетаданныхПО.ПолноеИмя = &ПолноеИмя";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если (Выборка.Следующий()) Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОбъектМетаданыхЯвляетсяТриггером(ПолноеИмяМетаданных) Экспорт
	
	СсылкаНаОбъектМетаданных = ПолучитьСсылкуОбъектаМетаданных(ПолноеИмяМетаданных);
	
	Если (СсылкаНаОбъектМетаданных = Неопределено) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// #РеквизитыОбъектов
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъектМетаданных);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыМетаданныхПО.Ссылка
		|ИЗ
		|	Справочник.ОбъектыМетаданныхПО КАК ОбъектыМетаданныхПО
		|ГДЕ
		|	ОбъектыМетаданныхПО.Ссылка = &Ссылка
		|	И ОбъектыМетаданныхПО.ЯвляетсяТриггером";
		
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ОбъектМетаданныхМожетИметьПоказатели(ПолноеИмяМетаданных) Экспорт
	
	СсылкаНаОбъектМетаданных = ПолучитьСсылкуОбъектаМетаданных(ПолноеИмяМетаданных);
	
	Если (СсылкаНаОбъектМетаданных = Неопределено) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// #РеквизитыОбъектов
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъектМетаданных);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыМетаданныхПО.Ссылка
		|ИЗ
		|	Справочник.ОбъектыМетаданныхПО КАК ОбъектыМетаданныхПО
		|ГДЕ
		|	ОбъектыМетаданныхПО.Ссылка = &Ссылка
		|	И ОбъектыМетаданныхПО.МожетИметьПоказатели";
		
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
